"""
18. Шаховий кінь ходить буквою "Г" - на дві клітини по вертикалі в будь-якому напрямку і на одну
клітку по горизонталі, або навпаки. Дано дві різні клітини шахової дошки, визначте, чи може кінь
потрапити з першої клітини на другу одним ходом.
Скорий Євген 141
"""

def move(x1, y1, x2, y2):
    while True:
        if y2 == y1 + 2 and (x2 == x1 + 1 or x2 == x1 - 1):
            print("Кінь може потрапити з першої клітини на другу одним ходом")
            break
        elif y2 == y1 - 2 and (x2 == x1 + 1 or x2 == x1 - 1):
            print("Кінь може потрапити з першої клітини на другу одним ходом")
            break
        elif x2 == x1 - 2 and (y2 == y1 + 1 or y2 == y1 - 1):
            print("Кінь може потрапити з першої клітини на другу одним ходом")
            break
        elif x2 == x1 + 2 and (y2 == y1 + 1 or y2 == y1 - 1):
            print("Кінь може потрапити з першої клітини на другу одним ходом")
            break
        else:
            print("Кінь не може потрапити з першої клітини на другу одним ходом")

print("Введіть координати клітинки в якій знаходится кінь:")
x1 = int(input("Введіть х1 = "))
y1 = int(input("Введіть y1 = "))
print("Введіть координати куди ви бажаете перемістити коня:")
x2 = int(input("Введіть x2 = "))
y2 = int(input("Введіть y2 = "))

move(x1, y1, x2, y2)