"""
13. За довжинами трьох відрізків, введених користувачем, визначити можливість існування
трикутника, складеного з цих відрізків. Якщо такий трикутник існує, то визначити, чи є він
різнобічним, рівнобедреним або рівностороннім.
корий Євген 141
"""

def result(a1, b1, c1):
    if a1 == b1 == c1:
        print("\nТрикутник рівносторонній")
    elif a1 == b1 != c1 or a1 == c1 != b1 or b1 == c1 != a1:
        print("\nТрикутник рівнобедрений")
    elif a1 != b1 and a1 != c1 and b1 != c1:
        print("\nТрикутник різнобічний")


print("Введіть довжини сторін трикутника")
a = float(input("Введіть сторону A = "))
b = float(input("Введіть сторону B = "))
c = float(input("Введіть сторону C = "))

while True:
    if a + b > c and b + c > a and a + c > b:
        break
    else:
        print("Трикутника не існує")
        a = float(input("Введіть сторону A = "))
        b = float(input("Введіть сторону B = "))
        c = float(input("Введіть сторону C = "))

result(a, b, c)