"""
9. Мастям гральних карт присвоєно порядкові номери: 1 - піки, 2 - трефи, 3 - бубни, 4 - черви.
Вартості карт, які старші за десятку, привласнені номери: 11 - валет, 12 - дама, 13 - король, 14 - туз.
Дано два цілих числа: N - вартість (6 ≤ N ≤ 14) і M - масть карти (1 ≤ M ≤ 4). Вивести назву
відповідної карти виду «шістка бубон», «дама черв», «туз треф», тощо
Скорий Євген 141
"""

def suit(n, m):
    a = ""
    b = ""
    if n == 6:
        a = "шість"
    elif n == 7:
        a = "сім"
    elif n == 8:
        a = "вісім"
    elif n == 9:
        a = "дев'ять"
    elif n == 10:
        a = "десять"
    elif n == 11:
        a = "валет"
    elif n == 12:
        a = "дама"
    elif n == 13:
        a = "король"
    elif n == 14:
        a = "туз"

    if m == 1:
        b = "піки"
    elif m == 2:
        b = "хрести"
    elif m == 3:
        b = "бубни"
    elif m == 4:
        b = "чірви"
    print("\nВаша карта - ",a , " ", b)


print("Введіть вартість карти та її масть")
n = int(input("Введіть вартість карти N (від 6 до 14) = "))
m = int(input("Введіть масть карти M (від 1 до 4) = "))

while True:
    if 5 < n < 15:
        break
    else:
        print("такої карти немає")
        n = int(input("Введіть вартість карти N (від 6 до 14) = "))
while True:
    if 0 < m < 5:
        break
    else:
        print("Такої масті немає")
        m = int(input("Введіть масть карти M (від 1 до 4) = "))

suit(n,m)